In [34]:
# import the pandas library
import pandas as pd
left = pd.DataFrame({
   'id':[1,1,3,1,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame({
   'id':[1,2,3,4,5],
   'DOCA': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'FUNKA':['sub2','sub4','sub3','sub6','sub5']})
print(left)
print("------------------------")
print(right)

     Name  id subject_id
0    Alex   1       sub1
1     Amy   1       sub2
2   Allen   3       sub4
3   Alice   1       sub6
4  Ayoung   5       sub5
------------------------
    DOCA FUNKA  id
0  Billy  sub2   1
1  Brian  sub4   2
2   Bran  sub3   3
3  Bryce  sub6   4
4  Betty  sub5   5

In [35]:
k = right.set_index("id")
#print(k)
left.join(k,lsuffix="L",rsuffix="R",on="id")

     Name  id subject_id   DOCA FUNKA
0    Alex   1       sub1  Billy  sub2
1     Amy   1       sub2  Billy  sub2
2   Allen   3       sub4   Bran  sub3
3   Alice   1       sub6  Billy  sub2
4  Ayoung   5       sub5  Betty  sub5

In [36]:
pd.merge(left,right,on= "id",how = "left")

     Name  id subject_id   DOCA FUNKA
0    Alex   1       sub1  Billy  sub2
1     Amy   1       sub2  Billy  sub2
2   Allen   3       sub4   Bran  sub3
3   Alice   1       sub6  Billy  sub2
4  Ayoung   5       sub5  Betty  sub5

In [13]:
left.join(right,lsuffix="L",rsuffix="R")

    NameL  idL subject_idL  NameR  idR subject_idR
0    Alex    1        sub1  Billy    1        sub2
1     Amy    2        sub2  Brian    2        sub4
2   Allen    3        sub4   Bran    3        sub3
3   Alice    4        sub6  Bryce    4        sub6
4  Ayoung    5        sub5  Betty    5        sub5